/*给定一个长度为n的整数数组，数组中连续的相等元素构成的子序列称为平台。
试设计算法，求出数组中最长平台的长度 */
//众所周知，变量名可以是下划线 
#include<stdio.h>
main()
{
	int n;
	scanf("%d",&n);
	
	int _[n];
	int ___[n];
	int _0_=0;
	
	for (int __=0;__<n;__++){
		scanf("%d",&_[__]);
	}
	for (int __=0;__<n;__++){
		int ____=1;
		for (int ______=__;______<n;______++){
			if (_[______]==_[______+1]){
				____++;
			}
			else {
				break;
			}
		}
		___[__]=____;
	}
	for (int __=0;__<n;__++){
		if (___[__]>_0_){
			_0_=___[__];
		}
	}
	printf("%d",_0_);
	return 0;
}
